AccumulationRegisters/ОстаткиТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТовара</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Резерв</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Затрата</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ПроведениеДокументов/Ext/Module.bsl
//
//
Процедура ПроверитьЗаполнениеРеквизитов(ДокументОбъект, РеквизитыСтрокой, Отказ) Экспорт
	
	ТекстСообщения = "";
	мас = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(РеквизитыСтрокой);		
	Для каждого ИмяРеквизита Из мас Цикл
		Если НЕ ЗначениеЗаполнено(ДокументОбъект[ИмяРеквизита]) Тогда 
			Отказ = Истина;
			ТекстСообщения = ТекстСообщения + ДокументОбъект.Метаданные().Реквизиты[ИмяРеквизита].Синоним + ", ";
		КонецЕсли;
	КонецЦикла;
	Если ТекстСообщения <> "" Тогда
		ТекстСообщения = Лев(ТекстСообщения, СтрДлина(ТекстСообщения)-2);
		ТекстСообщения = СтрШаблон("%1: %2 !)",
									НСтр("ru = 'Не заполнен(ы) реквизит(ы)'; en = 'Details are missing'"),
									ТекстСообщения);
		Сообщить(ТекстСообщения);
	КонецЕсли;             
	
КонецПроцедуры   

// Процедура формирует по переданной структуре полей запрос по табличной части документа.
//
// Параметры: 
//  ДокументОбъект        - объект проводимого документа, 
//  ИмяТабличнойЧасти     - имя табличной части,
//  СтруктураПолей        - структура, ключ структуры содержит псевдоним поля запроса, значение - строку запроса,
//  СтруктураСложныхПолей - структура, ключ структуры содержит псевдоним поля запроса, значение - строку запроса,
//                          необязательный параметр, служит для передачи конструкций типа "ВЫБОР" и т.д.
//
// Возвращаемое значение:
//  Результат запроса.
//
Функция СформироватьЗапросПоТабличнойЧасти (ДокументОбъект, ИмяТабличнойЧасти, 
											СтруктураПолей, СтруктураСложныхПолей = Неопределено) Экспорт
	ТекстЗапроса = "";
	Для Каждого Реквизит Из СтруктураПолей Цикл
		ТекстЗапроса  = ТекстЗапроса + ",
		|Док." + Реквизит.Значение + " КАК " + СокрЛП(Реквизит.Ключ);
	КонецЦикла;
	
	Если ТипЗнч(СтруктураСложныхПолей) = Тип("Структура") Тогда
		Для Каждого Элемент Из СтруктураСложныхПолей Цикл
			ТекстЗапроса  = ТекстЗапроса + ",
			| " + Элемент.Значение + " КАК " + СокрЛП(Элемент.Ключ);
		КонецЦикла;
	КонецЕсли;
	
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ 
	| Док.НомерСтроки " + ТекстЗапроса + "
	| ИЗ 
	|      Документ." + МетаданныеДокумента.Имя + "."+ СокрЛП(ИмяТабличнойЧасти) + 
	" КАК Док 
	|     ГДЕ Док.Ссылка = &ДокументСсылка";
	
	Запрос.УстановитьПараметр("ДокументСсылка" , ДокументОбъект.Ссылка);
	
	Возврат Запрос.Выполнить();
	
КонецФункции // СформироватьЗапросПоТабличнойЧасти()

//
//
Функция ПолучитьТаблицуИзТабличнойЧасти() Экспорт

	

КонецФункции // ПолучитьТаблицуИзТабличнойЧасти()

Процедура ПроверитьНаТолькоТовары(ТаблицаТовары, Ошибки) Экспорт

	Запрос = Новый Запрос; 
	Запрос.УстановитьПараметр("ТЗ", ТаблицаТовары);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗ.НомерСтроки КАК НомерСтрокиТЧ,
	               |	ТЗ.Номенклатура КАК Номенклатура,
	               |	ТЗ.ТипНоменклатуры КАК ТипНоменклатуры
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	&ТЗ КАК ТЗ
	               |ГДЕ
	               |	ТЗ.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ.НомерСтрокиТЧ КАК НомерСтрокиТЧ,
	               |	ВТ.Номенклатура КАК Номенклатура,
	               |	ВТ.ТипНоменклатуры КАК ТипНоменклатуры
	               |ИЗ
	               |	ВТ КАК ВТ";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Ошибки.Добавить(СтрШаблон(НСтр("ru = 'Строка %1: номенклатура %2 с видом %3!'; en = 'Line %1: good %2 has kind %3!'"), 
						Выборка.НомерСтрокиТЧ, Выборка.Номенклатура, Выборка.ТипНоменклатуры));
	КонецЦикла;

КонецПроцедуры

Процедура ПроверитьНаОстаткиТоваров(ТаблицаТовары, Дата, Склад, Ошибки, Фирма = Неопределено) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТЗ", ТаблицаТовары);
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Фирма", ?(Фирма = Неопределено, ПараметрыСеанса.Фирма, Фирма));
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗ.НомерСтроки КАК НомерСтрокиТЧ,
	               |	ТЗ.Номенклатура КАК Номенклатура,
	               |	ТЗ.Партия КАК Партия,
	               |	ТЗ.Серия КАК Серия,
	               |	ТЗ.Количество КАК Количество
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	&ТЗ КАК ТЗ
	               |ГДЕ
	               |	ТЗ.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Товар)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ.НомерСтрокиТЧ КАК НомерСтрокиТЧ,
	               |	ВТ.Номенклатура КАК Номенклатура,
	               |	ВТ.Партия КАК Партия,
	               |	ВТ.Серия КАК Серия,
	               |	ВТ.Количество КАК Количество,
	               |	ЕСТЬNULL(ОстаткиПартий.ОстатокОстаток, 0) КАК Остаток
	               |ИЗ
	               |	ВТ КАК ВТ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТовара.Остатки(
	               |				,
	               |				Партия В
	               |						(ВЫБРАТЬ
	               |							Т.Партия
	               |						ИЗ
	               |							ВТ КАК Т)
	               |					И Склад = &Склад
	               |					И Фирма = &Фирма) КАК ОстаткиПартий
	               |		ПО ВТ.Партия = ОстаткиПартий.Партия";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл

	КонецЦикла;

КонецПроцедуры
